# DockablePaneProviderData Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DockablePaneProviderData Class
Members See Also
---
Information about a new dockable pane being added to the Revit user interface.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class DockablePaneProviderData
```

Visual Basic
---
```text
Public Class DockablePaneProviderData
```

Visual C++
---
```text
public ref class DockablePaneProviderData
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.UI..::..DockablePaneProviderData
# See Also
DockablePaneProviderData Members
Autodesk.Revit.UI Namespace